tap "anomalyco/tap"
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "cloudfoundry/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "peteonrails/voxtype"
tap "robscott/tap"
tap "romkatv/gitstatus"
tap "simnalamburt/x"
tap "slp/qemu-m1"
tap "tursodatabase/tap"
tap "universal-ctags/universal-ctags"
tap "uzimaru0000/tap"
tap "weaveworks/tap"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Mozilla CA certificate store
brew "ca-certificates"
# C parser in Python
brew "pycparser"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Extremely Fast Compression algorithm
brew "lz4"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Library and utilities for processing GIFs
brew "giflib"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Portable Foreign Function Interface library
brew "libffi"
# HTTP/2 C Library
brew "libnghttp2"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Garbage collector for C and C++
brew "bdw-gc"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Incremental parsing library
brew "tree-sitter"
# Emacs dependency management
brew "cask"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Statistics utility to count lines of code
brew "cloc"
# CloudFormation Provider Development Toolkit
brew "cloudformation-cli"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# NTLM authentication proxy with tunneling
brew "cntlm"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Tunnel SSH through HTTP proxies
brew "corkscrew"
# Tool for interacting with remote images and registries
brew "crane"
# Reimplementation of ctags(1)
brew "ctags"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# GNU database manager
brew "gdbm"
# Debian package management system
brew "dpkg"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Distributed revision control system
brew "git"
# Regular expressions library
brew "oniguruma"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Official GitLab CI runner
brew "gitlab-runner"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Converts markdown into roff (man pages)
brew "go-md2man"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Go cross compile tool
brew "gox"
# Library access to GnuPG
brew "gpgme"
# New file format for still image compression
brew "jpeg-xl"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Open source suite of directory software
brew "openldap"
# Free Kerberos 5 implementation
brew "heimdal"
# Kubernetes package manager
brew "helm"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Istio configuration command-line utility
brew "istioctl"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Json incremental digger
brew "jid"
# CLI for the Jinja2 templating language
brew "jinja2-cli", link: false
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# LastPass command-line interface tool
brew "lastpass-cli"
# DNS library written in C
brew "ldns"
# CBOR protocol implementation for C and others
brew "libcbor"
# Asynchronous event library
brew "libev"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Conversion library
brew "libiconv"
# Library for large linear classification
brew "liblinear"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# C library for creating IP packets
brew "libnet"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# General purpose TCP-IP emulator
brew "libslirp"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Command-line utility to interact with linkerd
brew "linkerd"
# Powerful, lightweight programming language
brew "lua"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Java-based project management
brew "maven"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Tokencode generator compatible with RSA SecurID 128-bit (AES)
brew "stoken"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Performant, and portable jq wrapper to support formats other than JSON
brew "oq"
# Perl compatible regular expressions library
brew "pcre"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit", link: false
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Implements a XML/HTML/XHTML Markup safe string for Python
brew "python-markupsafe"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# YAML framework for Python
brew "pyyaml"
# Ethernet compliant virtual network
brew "vde"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Collection of tools for managing UNIX services
brew "runit"
# Safe, concurrent, practical language
brew "rust"
# Python 2 and 3 compatibility utilities
brew "six"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Language for application scale JavaScript development
brew "typescript"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Image processing library
brew "vips"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh", trusted: true
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Web browser focusing on privacy
cask "brave-browser"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Free and open-source image editor
cask "gimp"
# Customise mouse behavior
cask "linearmouse"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Push-to-talk voice-to-text
cask "peteonrails/voxtype/voxtype"
go "github.com/cosmtrek/air"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "github.com/elastic/crd-ref-docs"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/keyify"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
go "github.com/google/yamlfmt/cmd/yamlfmt"
krew "ktop"
npm "get-graphql-schema"
