tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "int128/kubelogin"
tap "robscott/tap"
tap "romkatv/gitstatus"
tap "simnalamburt/x"
tap "slp/qemu-m1"
tap "uzimaru0000/tap"
tap "weaveworks/tap"
brew "adns"
brew "adr-tools"
brew "ca-certificates"
brew "icu4c"
brew "readline"
brew "libyaml"
brew "mpdecimal"
brew "openssl@3"
brew "six"
brew "xz"
brew "pyyaml"
brew "ansible"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "giflib"
brew "graphite2"
brew "harfbuzz"
brew "jpeg-turbo"
brew "lz4"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openjdk"
brew "ant"
brew "m4"
brew "autoconf"
brew "automake"
brew "brotli"
brew "c-ares"
brew "libnghttp2"
brew "libuv"
brew "node"
brew "aws-cdk"
brew "aws-iam-authenticator"
brew "awscli"
brew "awslogs"
brew "bdw-gc"
brew "bfg"
brew "capstone"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "jansson"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "cilium-cli"
brew "cloudformation-cli"
brew "cmake"
brew "cmatrix"
brew "cntlm"
brew "corkscrew"
brew "crane"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "deno"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "dos2unix"
brew "gdbm"
brew "dpkg"
brew "eksctl"
brew "exiftool"
brew "fzf"
brew "git"
brew "git-filter-repo"
brew "git-flow"
brew "git-gui"
brew "git-lfs"
brew "gitlab-runner"
brew "gitleaks"
brew "gnu-sed"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "go-md2man"
brew "golangci-lint"
brew "gopls"
brew "gox"
brew "gpgme"
brew "libtool"
brew "graphicsmagick"
brew "pkg-config"
brew "guile"
brew "heimdal"
brew "helm"
brew "ncurses"
brew "htop"
brew "hubble"
brew "istioctl"
brew "jemalloc"
brew "jid"
brew "jinja2-cli"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lastpass-cli"
brew "ldns"
brew "libcbor"
brew "libev"
brew "libffi"
brew "libfido2"
brew "libiconv"
brew "liblinear"
brew "libnet"
brew "libpthread-stubs"
brew "libslirp"
brew "libssh"
brew "unibilium"
brew "libtermkey"
brew "libvterm"
brew "linkerd"
brew "lua"
brew "lua@5.1"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "maven"
brew "ninja"
brew "meson"
brew "msgpack"
brew "zlib"
brew "mysql"
brew "neovim"
brew "nghttp2"
brew "pcre"
brew "nmap"
brew "stoken"
brew "openconnect"
brew "openjdk@11"
brew "openssh"
brew "oq"
brew "vde"
brew "qemu"
brew "podman"
brew "postgresql@14"
brew "protobuf"
brew "putty"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "ranger"
brew "re2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "runit"
brew "rust"
brew "skaffold"
brew "sonar-scanner"
brew "tcptraceroute"
brew "terraform"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "typescript"
brew "vale"
brew "vault"
brew "w3m"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "fluxcd/tap/flux"
brew "int128/kubelogin/kubelogin"
brew "robscott/tap/kube-capacity"
brew "romkatv/gitstatus/gitstatus"
brew "slp/qemu-m1/qemu-m1"
brew "uzimaru0000/tap/tv"
brew "weaveworks/tap/gitops"
cask "bluesnooze"
cask "brave-browser"
cask "chromedriver"
cask "font-fira-code-nerd-font"
cask "kitty"
cask "podman-desktop"
cask "spotify"
cask "utm"
